In [9]:
pip install word2number

Requirement already satisfied: word2number in c:\users\asnat\anaconda3\lib\site-packages (1.1)
Note: you may need to restart the kernel to use updated packages.

In [12]:
print(w2n.word_to_num('one hundred thirty five'))

135

In [11]:
import numpy as np
import pandas as pd
from sklearn import linear_model
from word2number import w2n
from sklearn.linear_model import LinearRegression
from sklearn.model_selection import train_test_split

In [13]:
#import Dataset
df=pd.read_csv('hiring.csv')
df.head()

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000

In [14]:
#preprocessing dataset
df.experience=df.experience.fillna('zero')
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero                    8.0                           9      50000
1       zero                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [15]:
#Apply word to number
df.experience=df.experience.apply(w2n.word_to_num)
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    NaN                           7      72000
7          11                    7.0                           8      80000

In [17]:
#floor value to convert point value to whole num
import math
median_test_score=math.floor(df['test_score(out of 10)'].mean())
median_test_score

7

In [18]:
dff=df['test_score(out of 10)'].mean()
dff

np.float64(7.857142857142857)

In [19]:
df['test_score(out of 10)']=df['test_score(out of 10)'].fillna(dff)
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0               8.000000                           9      50000
1           0               8.000000                           6      45000
2           5               6.000000                           7      60000
3           2              10.000000                          10      65000
4           7               9.000000                           6      70000
5           3               7.000000                          10      62000
6          10               7.857143                           7      72000
7          11               7.000000                           8      80000

In [21]:
#show column name
df.columns

Index(['experience', 'test_score(out of 10)', 'interview_score(out of 10)',
       'salary($)'],
      dtype='object')

In [29]:
#Feature selection
predictors=['experience', 'test_score(out of 10)','interview_score(out of 10)']
x=df[predictors]
y=df['salary($)']

In [33]:
#Split train and test datasets
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.2,random_state=42)

In [34]:
x_train.shape,x_test.shape

((6, 3), (2, 3))

In [35]:
y_train.shape,y_test.shape

((6,), (2,))

In [36]:
reg=LinearRegression()